#include <stdio.h>
#include <locale.h>

void title();

void ending();

void enterInfo();

int main() {

    //Сменить названия переменных, чуть подправить таблицу
    setlocale(LC_ALL, "Rus");
    char sName[20], sName1[20], sName2[20], initials[20], initials1[20], initials2[20];
    float year, year1, year2;
    int salary, salary1, salary2;

    enterInfo();
    scanf ("%s %s %f %d", sName, initials, &year, &salary);
    enterInfo();
    scanf ("%s %s %f %d", sName1, initials1, &year1, &salary1);
    enterInfo();
    scanf ("%s %s %f %d", sName2, initials2, &year2, &salary2);

    title();
    printf ("|Вид транспорта            |маршрута             |Протяженность маршрута    |Время в дороге        | \n") ;
    printf ("|--------------------------------------------------------------------------------------------------| \n");
    printf ("|%-10s                  |%-8s                  |%-5.2f                     |%-5d             | \n", sName, initials, year, salary);
    printf ("|--------------------------------------------------------------------------------------------------| \n");
    printf ("|%-10s                  |%-8s                  |%-5.2f                     |%-5d             | \n", sName1, initials1, year1, salary1);
    printf ("|--------------------------------------------------------------------------------------------------| \n");
    printf ("|%-10s                  |%-8s                  |%-5.2f                     |%-5d             | \n", sName2, initials2, year2, salary2);
    ending();
    return 0;
}

void enterInfo() {
    printf ("Введите: вид транспорта, номер маршрута, протяженность маршрута, время в дороге: \n");
}

void ending() {
    printf ("|--------------------------------------------------------------------------------------------------| \n");
    printf ("|Примечание: Тр - трамвай, Тс - троллейбус, А - автобус                                            | \n");
    printf ("|--------------------------------------------------------------------------------------------------| \n");
}


void title(){
    printf ("|--------------------------------------------------------------------------------------------------| \n");
    printf ("|Ведомость общественного транспорта                                                                | \n") ;
    printf ("|--------------------------------------------------------------------------------------------------| \n");
}


